0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    sup_side_inlet
    {
        type            fixedValue;
	value		uniform (0 -6.0 0);
    }
    inf_side_inlet
    {
        type            fixedValue;
	value		uniform (0 6.0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    walls
    {
        type            noSlip;
    }
    solution_inlet
    {
        type            fixedValue;
	value		uniform (0.667231 0 0);
    }
}

// ************************************************************************* //
