0/solute
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      solute;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.050336;

boundaryField
{
    sup_side_inlet
    {
        type            fixedValue;
	value		uniform 0;
    }
    inf_side_inlet
    {
        type            fixedValue;
	value		uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.050336;
    }
    walls
    {
        type            zeroGradient;
    }
    solution_inlet
    {
        type            fixedValue;
	value		uniform 0.050336;
    }
}

// ************************************************************************* //
