constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    interpolationSchemes
    {
        rho         cell;
        U           cellPoint;
        mu          cell;
        supersat    cell;
        R_growth    cell;
        R_nucleation cell;
    }

    averagingMethod dual;

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            1273.0;
    alphaMax        0.9;
}

subModels
{
    particleForces
    {
        ErgunWenYuDrag
        {
            alphac alpha;
        }
        gravity;
    }

    injectionModels
    {
        model
        {
            type            patchInjection;
            parcelBasisType fixed;
            patchName       solution_inlet;
            U0              (0.667231 0 0);
            nParticle       1;
            parcelsPerSecond 100000;
            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution
                {
                    value   0;
                }
            }
            flowRateProfile constant 1;
            massTotal       0;
            SOI 0;
            duration 60;
            populationDensity (1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0);
            kv 0.0006250 ;
            dr 8.333333E-06 ;
            noNode 30 ;
            minmodeTheta 1.5;
        }
    }

    dispersionModel none;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            frontAndBack
            {
                type rebound;
                e    1;
                mu   0;
            }

            walls
            {
                type rebound;
                e    1;
                mu   0;
            }

            "sup_side_inlet|inf_side_inlet|solution_inlet|outlet"
            {
                type escape;
            }
        );
    }

    heatTransferModel none;

    surfaceFilmModel none;

    packingModel explicit;

    explicitCoeffs
    {
        particleStressModel
        {
            type HarrisCrighton;
            alphaPacked 0.6;
            pSolid 20.0;
            beta 2.0;
            eps 1.0e-7;
        }
        correctionLimitingMethod
        {
            type absolute;
            e 0.9;
        }
    }

    implicitCoeffs
    {
        alphaMin 1e-10;
        rhoMin 782;
        applyLimiting true;
        applyGravity false;
        particleStressModel
        {
            type HarrisCrighton;
            alphaPacked 0.6;
            pSolid 20.0;
            beta 2.0;
            eps 1.0e-2;
        }
    }


    dampingModel relaxation;

    relaxationCoeffs
    {
        timeScaleModel
        {
            type nonEquilibrium;
            alphaPacked 0.58;
            e 0.9;
        }
    }

    isotropyModel stochastic;

    stochasticCoeffs
    {
        timeScaleModel
        {
            type isotropic;
            alphaPacked 0.58;
            e 0.9;
        }
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{}


// ************************************************************************* //
